tests/modules/recurly_test_client/fixtures/subscriptions/preview-200-change.xml

HTTP/1.1 200 OK
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<subscription href="https://api.recurly.com/v2/subscriptions/67622636e1afcdf6ecc4604aaa84130d">
  <account href="https://api.recurly.com/v2/accounts/user-1"/>
  <address>
    <name>Test Three</name>
    <address1>3026 There Street</address1>
    <address2></address2>
    <city>Stillwater</city>
    <state>MN</state>
    <zip>55082</zip>
    <country>US</country>
    <phone nil="nil"></phone>
  </address>
  <plan href="https://api.recurly.com/v2/plans/silver">
    <plan_code>silver</plan_code>
    <name>Silver</name>
  </plan>
  <auto_renew type="boolean">true</auto_renew>
  <renewal_billing_cycles type="integer">1</renewal_billing_cycles>
  <current_term_started_at type="datetime">2023-01-27T13:11:43Z</current_term_started_at>
  <current_term_ends_at type="datetime">2023-02-27T13:11:43Z</current_term_ends_at>
  <revenue_schedule_type>evenly</revenue_schedule_type>
  <uuid>32558dd8a07eec471fbe6642d3a422f4</uuid>
  <state>active</state>
  <unit_amount_in_cents type="integer">1000</unit_amount_in_cents>
  <currency>USD</currency>
  <quantity type="integer">2</quantity>
  <activated_at type="datetime">2023-01-27T13:11:43Z</activated_at>
  <canceled_at nil="nil"></canceled_at>
  <expires_at nil="nil"></expires_at>
  <updated_at type="datetime">2023-01-27T13:11:43Z</updated_at>
  <total_billing_cycles type="integer">1</total_billing_cycles>
  <remaining_billing_cycles type="integer">0</remaining_billing_cycles>
  <current_period_started_at type="datetime">2023-01-27T13:11:43Z</current_period_started_at>
  <current_period_ends_at type="datetime">2023-02-27T13:11:43Z</current_period_ends_at>
  <trial_started_at nil="nil"></trial_started_at>
  <trial_ends_at nil="nil"></trial_ends_at>
  <terms_and_conditions nil="nil"></terms_and_conditions>
  <customer_notes nil="nil"></customer_notes>
  <started_with_gift type="boolean">false</started_with_gift>
  <converted_at nil="nil"></converted_at>
  <imported_trial type="boolean">false</imported_trial>
  <paused_at nil="nil"></paused_at>
  <remaining_pause_cycles nil="nil"></remaining_pause_cycles>
  <no_billing_info_reason></no_billing_info_reason>
  <gateway_code nil="nil"></gateway_code>
  <cost_in_cents type="integer">2000</cost_in_cents>
  <po_number nil="nil"></po_number>
  <net_terms type="integer">0</net_terms>
  <collection_method>automatic</collection_method>
  <subscription_add_ons type="array">
  </subscription_add_ons>
  <custom_fields type="array">
  </custom_fields>
  <invoice_collection>
    <charge_invoice>
      <account href="https://api.recurly.com/v2/accounts/user-1"/>
      <dunning_campaign_id nil="nil"></dunning_campaign_id>
      <address>
        <name_on_account nil="nil"></name_on_account>
        <first_name>Test</first_name>
        <last_name>Three</last_name>
        <company></company>
        <address1>3026 There Street</address1>
        <address2></address2>
        <city>Stillwater</city>
        <state>MN</state>
        <zip>55082</zip>
        <country>US</country>
        <phone nil="nil"></phone>
      </address>
      <uuid>67622f9dc7371fdcbb2016441eb1aeae</uuid>
      <state>pending</state>
      <invoice_number_prefix></invoice_number_prefix>
      <invoice_number nil="nil"></invoice_number>
      <vat_number></vat_number>
      <tax_in_cents type="integer">0</tax_in_cents>
      <total_in_cents type="integer">1000</total_in_cents>
      <currency>USD</currency>
      <created_at nil="nil"></created_at>
      <updated_at nil="nil"></updated_at>
      <attempt_next_collection_at type="datetime">2023-01-27T13:21:59Z</attempt_next_collection_at>
      <closed_at nil="nil"></closed_at>
      <customer_notes nil="nil"></customer_notes>
      <recovery_reason nil="nil"></recovery_reason>
      <gateway_code nil="nil"></gateway_code>
      <subtotal_before_discount_in_cents type="integer">1000</subtotal_before_discount_in_cents>
      <subtotal_in_cents type="integer">1000</subtotal_in_cents>
      <discount_in_cents type="integer">0</discount_in_cents>
      <due_on type="datetime">2023-01-27T13:21:59Z</due_on>
      <net_terms type="integer">0</net_terms>
      <collection_method>automatic</collection_method>
      <po_number nil="nil"></po_number>
      <terms_and_conditions nil="nil"></terms_and_conditions>
      <line_items type="array">
        <adjustment type="charge">
          <account href="https://api.recurly.com/v2/accounts/user-1"/>
          <bill_for_account href="https://api.recurly.com/v2/accounts/user-1"/>
          <uuid>67622f9db5c98ba94881ea4a698995b6</uuid>
          <state>pending</state>
          <description>Silver</description>
          <accounting_code></accounting_code>
          <product_code>silver</product_code>
          <origin>plan</origin>
          <unit_amount_in_cents type="integer">1000</unit_amount_in_cents>
          <quantity type="integer">1</quantity>
          <discount_in_cents type="integer">0</discount_in_cents>
          <tax_in_cents type="integer">0</tax_in_cents>
          <total_in_cents type="integer">1000</total_in_cents>
          <currency>USD</currency>
          <proration_rate type="float">0.9998</proration_rate>
          <start_date type="datetime">2023-01-27T13:21:59Z</start_date>
          <end_date type="datetime">2023-02-27T13:11:43Z</end_date>
          <created_at nil="nil"></created_at>
          <updated_at nil="nil"></updated_at>
          <revenue_schedule_type>evenly</revenue_schedule_type>
        </adjustment>
      </line_items>
      <transactions type="array">
      </transactions>
    </charge_invoice>
    <credit_invoices type="array">
    </credit_invoices>
  </invoice_collection>
</subscription>
